package com.example.audio_visul_android.model;

import java.util.List;

public class MusicItemModel {

    /**
     * data : [{"type":"qq","link":"http://y.qq.com/n/yqq/song/001NmPTG1fVsUw.html","songid":"001NmPTG1fVsUw","title":"夜空中最亮的星","author":"逃跑计划","lrc":"[ti:夜空中最亮的星 (《摘星的你》微电影主题曲)]\n[ar:逃跑计划]\n[al:世界]\n[by:]\n[offset:0]\n[00:00.00]夜空中最亮的星 - 逃跑计划 (Escape Plan)\n[00:06.08]词：逃跑计划\n[00:12.17]曲：逃跑计划\n[00:18.25]夜空中最亮的星 能否听清\n[00:24.66]\n[00:27.01]那仰望的人 心底的孤独和叹息\n[00:33.60]\n[00:35.89]Oh 夜空中最亮的星 能否记起\n[00:42.58]\n[00:44.80]曾与我同行 消失在风里的身影\n[00:50.61]\n[00:52.52]我祈祷拥有一颗透明的心灵\n[00:57.66]和会流泪的眼睛\n[01:01.01]\n[01:03.21]给我再去相信的勇气\n[01:06.51]Oh 越过谎言去拥抱你\n[01:10.49]每当我找不到存在的意义\n[01:15.31]每当我迷失在黑夜里\n[01:18.93]\n[01:19.60]Oh 夜空中最亮的星\n[01:24.26]请指引我靠近你\n[01:28.20]\n[01:38.30]夜空中最亮的星 是否知道\n[01:44.88]\n[01:46.94]曾与我同行的身影 如今在哪里\n[01:52.84]\n[01:55.93]Oh 夜空中最亮的星 是否在意\n[02:02.39]\n[02:04.38]是等太阳升起 还是意外先来临\n[02:10.64]\n[02:12.45]我宁愿所有痛苦都留在心里\n[02:17.55]也不愿忘记你的眼睛\n[02:21.35]\n[02:23.18]给我再去相信的勇气\n[02:26.40]Oh 越过谎言去拥抱你\n[02:30.64]每当我找不到存在的意义\n[02:35.27]每当我迷失在黑夜里\n[02:39.79]Oh 夜空中最亮的星\n[02:44.15]Oh 请照亮我前行\n[02:48.20]\n[03:06.13]我祈祷拥有一颗透明的心灵\n[03:11.02]和会流泪的眼睛\n[03:14.63]\n[03:16.51]给我再去相信的勇气\n[03:19.68]Oh 越过谎言去拥抱你\n[03:22.74]\n[03:23.83]每当我找不到存在的意义\n[03:28.70]每当我迷失在黑夜里\n[03:32.16]\n[03:33.09]Oh 夜空中最亮的星\n[03:37.49]Oh 请照亮我前行\n[03:43.10]\n[03:51.37]夜空中最亮的星 能否听清\n[03:58.03]\n[04:00.22]那仰望的人 心底的孤独和叹息","url":"http://dl.stream.qqmusic.qq.com/C100001NmPTG1fVsUw.m4a?fromtag=38","pic":"http://y.gtimg.cn/music/photo_new/T002R300x300M000000wr4zc1gls3e.jpg"},{"type":"qq","link":"http://y.qq.com/n/yqq/song/0044g6hb1mnYOV.html","songid":"0044g6hb1mnYOV","title":"夜空中最亮的星 (Live)","author":"张杰","lrc":"[ti:夜空中最闪亮的星]\n[ar:张杰]\n[al:]\n[by:]\n[offset:0]\n[00:00.00]夜空中最亮的星 (Live) - 张杰 (Jason Zhang)\n[00:12.36]词：逃跑计划\n[00:24.72]曲：逃跑计划\n[00:37.08]夜空中最亮的星 能否听清\n[00:43.41]\n[00:45.51]那仰望的人 心底的孤独和叹息\n[00:51.19]\n[00:54.48]夜空中最亮的星 能否记起\n[01:00.92]\n[01:02.87]曾与我同行 消失在风里的身影\n[01:09.10]\n[01:10.48]我祈祷拥有一颗透明的心灵\n[01:15.46]和会流泪的眼睛\n[01:18.48]\n[01:21.24]给我再去相信的勇气\n[01:24.04]越过谎言去拥抱你\n[01:27.18]\n[01:28.25]每当我找不到存在的意义\n[01:32.71]每当我迷失在黑夜里\n[01:35.56]\n[01:38.67]夜空中最亮的星\n[01:41.11]\n[01:42.12]请指引我前行\n[01:44.54]\n[02:08.84]夜空中最亮的星 是否知道\n[02:15.03]\n[02:17.10]曾与我同行的身影 如今在哪里\n[02:22.65]\n[02:26.21]夜空中最亮的星 是否在意\n[02:32.08]\n[02:34.23]是等太阳升起 还是意外先来临\n[02:39.36]\n[02:42.31]我宁愿所有痛苦都留在心里\n[02:46.88]也不愿忘记你的眼睛\n[02:51.54]\n[02:52.54]给我再去相信的勇气\n[02:55.74]越过谎言去拥抱你\n[02:59.07]\n[02:59.92]每当我找不到存在的意义\n[03:04.45]每当我迷失在黑夜里\n[03:07.52]\n[03:10.23]夜空中最亮的星 请照亮我前行\n[03:16.56]\n[04:31.46]我祈祷拥有一颗透明的心灵\n[04:35.97]和会流泪的眼睛\n[04:39.15]\n[04:41.54]给我再去相信的勇气\n[04:44.60]越过谎言去拥抱你\n[04:49.05]每当我找不到存在的意义\n[04:53.36]每当我迷失在黑夜里\n[04:59.16]夜空中最亮的星\n[05:02.10]\n[05:02.62]请照亮我前行\n[05:05.71]\n[05:16.42]夜空中最亮的星 能否听清\n[05:22.48]\n[05:24.82]那仰望的人 心底的孤独和叹息","url":"http://dl.stream.qqmusic.qq.com/C1000044g6hb1mnYOV.m4a?fromtag=38","pic":"http://y.gtimg.cn/music/photo_new/T002R300x300M000004eXiH125yZca.jpg"},{"type":"qq","link":"http://y.qq.com/n/yqq/song/003hKox604v5Ar.html","songid":"003hKox604v5Ar","title":"夜空中最亮的星","author":"厦门六中合唱团","lrc":"[ti:夜空中最亮的星]\n[ar:厦门六中合唱团]\n[al:]\n[by:]\n[offset:0]\n[00:00.00]夜空中最亮的星 - 厦门六中合唱团 (Season Singers)\n[00:06.38]词：逃跑计划\n[00:12.77]曲：逃跑计划\n[00:19.16]夜空中最亮的星\n[00:23.13]能否听清\n[00:27.68]那仰望的人\n[00:29.88]心底的孤独和叹息\n[00:36.82]夜空中最亮的星\n[00:40.93]能否记起\n[00:45.44]曾与我同行\n[00:47.63]消失在风里的身影\n[00:53.26]我祈祷拥有一颗透明的心灵\n[00:58.49]和会流泪的眼睛\n[01:02.68]Oh\n[01:04.00]给我再去相信的勇气\n[01:06.95]Oh\n[01:07.21]越过谎言去拥抱你\n[01:11.14]每当我找不到存在的意义\n[01:16.00]每当我迷失在黑夜里\n[01:20.46]Oh\n[01:21.78]夜空中最亮的星\n[01:25.11]请指引我靠近你\n[01:28.74]我祈祷拥有一颗透明的心灵\n[01:33.96]和会流泪的眼睛\n[01:38.18]Oh\n[01:39.52]给我再去相信的勇气\n[01:42.61]Oh\n[01:42.91]越过谎言去拥抱你\n[01:46.69]每当我找不到存在的意义\n[01:51.55]每当我迷失在黑夜里\n[01:56.10]Oh\n[01:57.36]夜空中最亮的星\n[02:00.78]Oh\n[02:00.99]请照亮我前行\n[02:23.70]夜空中最亮的星","url":"http://dl.stream.qqmusic.qq.com/C100003hKox604v5Ar.m4a?fromtag=38","pic":"http://y.gtimg.cn/music/photo_new/T002R300x300M000001ZaCQY2OxVMg.jpg"},{"type":"qq","link":"http://y.qq.com/n/yqq/song/0025vIrp10BG6f.html","songid":"0025vIrp10BG6f","title":"夜空中最亮的星 (Live)","author":"谭维维,蒋一侨","lrc":"[ti:夜空中最亮的星 (Live)]\n[ar:春风吹又生/独自绽放的树]\n[al:蒙面唱将猜猜猜第二季 第11期]\n[by:]\n[offset:0]\n[00:00.00]夜空中最亮的星 (Live) - 谭维维 (Sitar Tan)/蒋一侨\n[00:01.03]词：逃跑计划\n[00:02.07]曲：逃跑计划\n[00:03.11]编曲：Johnny yim\n[00:04.14]音乐总监：王笑冬\n[00:05.18]PGM：杨阳\n[00:06.22]键盘：达日丹/叶霖/张继旗\n[00:07.25]吉他手：Tommy/李雅宁\n[00:08.29]贝斯手：王聪\n[00:09.33]鼓手：CHRIS\n[00:10.37]打击乐：高兴\n[00:11.40]萨克斯：Charlie\n[00:12.44]小号：Paul\n[00:13.48]长号：Anthony\n[00:14.51]和声：悦伴歌声（王馨悦/余昭源/张恋歌/斳锐）\n[00:15.55]弦乐：靳海音弦乐团\n[00:16.59]声乐指导：刘芳\n[00:17.64]夜空中最亮的星\n[00:21.23]\n[00:22.33]能否听清\n[00:24.79]\n[00:26.38]那仰望的人\n[00:28.77]心底的孤独和叹息\n[00:33.80]\n[00:35.68]夜空中最亮的星\n[00:39.12]\n[00:40.15]能否记起\n[00:42.90]\n[00:44.55]曾与我同行\n[00:46.81]消失在风里的身影\n[00:51.98]我祈祷拥有一颗透明的心灵\n[00:57.34]和会流泪的眼睛\n[01:01.18]\n[01:02.91]给我再去相信的勇气\n[01:06.25]越过谎言去拥抱你\n[01:10.25]每当我找不到存在的意义\n[01:15.06]每当我迷失在黑夜里\n[01:18.97]\n[01:20.57]夜空中最亮的星\n[01:24.28]请指引我靠近你\n[01:28.73]\n[01:37.87]夜空中最亮的星\n[01:42.18]是否知道\n[01:44.55]\n[01:46.32]曾与我同行的身影\n[01:49.95]如今在哪里\n[01:53.59]\n[01:55.79]夜空中最亮的星\n[01:58.92]\n[02:00.17]是否在意\n[02:03.01]\n[02:04.14]是等太阳升起还是意外先来临\n[02:10.90]\n[02:12.36]我宁愿所有痛苦都藏在心里\n[02:17.35]也不愿忘记你的眼睛\n[02:21.57]\n[02:22.85]给我再去相信的勇气\n[02:26.23]越过谎言去拥抱你\n[02:30.35]每当我找不到存在的意义\n[02:35.01]每当我迷失在黑夜里\n[02:39.07]\n[02:40.64]夜空中最亮的星\n[02:44.44]请照亮我前行\n[02:47.57]照亮我前行\n[02:51.79]\n[02:56.77]我祈祷拥有一颗透明的心灵\n[03:01.87]和会流泪的眼睛\n[03:05.34]\n[03:07.41]给我再去相信的勇气\n[03:10.64]越过谎言去拥抱你\n[03:14.79]每当我找不到存在的意义\n[03:19.54]每当我迷失在黑夜里\n[03:24.23]\n[03:25.10]夜空中最亮的星\n[03:28.93]请照亮我前行\n[03:33.79]\n[03:42.52]夜空中最亮的星\n[03:46.24]\n[03:46.91]是否听清\n[03:49.71]\n[03:51.24]那仰望的人\n[03:53.44]心底的孤独和叹息","url":"http://dl.stream.qqmusic.qq.com/C1000025vIrp10BG6f.m4a?fromtag=38","pic":"http://y.gtimg.cn/music/photo_new/T002R300x300M000001mH3KE1Z6Prd.jpg"},{"type":"qq","link":"http://y.qq.com/n/yqq/song/002JMJa70OtRPz.html","songid":"002JMJa70OtRPz","title":"夜空中最亮的星 (钢琴版)","author":"纯音乐","lrc":"[00:00:00]此歌曲为没有填词的纯音乐，请您欣赏","url":"http://dl.stream.qqmusic.qq.com/C100002JMJa70OtRPz.m4a?fromtag=38","pic":"http://y.gtimg.cn/music/photo_new/T002R300x300M000001ZaCQY2OxVMg.jpg"},{"type":"qq","link":"http://y.qq.com/n/yqq/song/001RNAxF3N9zmR.html","songid":"001RNAxF3N9zmR","title":"夜空中最亮的星","author":"徐薇","lrc":"[ti:夜空中最亮的星]\n[ar:徐薇]\n[al:徐薇翻唱作品合集]\n[by:]\n[offset:0]\n[00:00.00]夜空中最亮的星 - 徐薇\n[00:07.57]词：逃跑计划\n[00:15.14]曲：逃跑计划\n[00:22.71]夜空中最亮的星 能否听清\n[00:30.35]\n[00:33.19]那仰望的人 心底的孤独和叹息\n[00:41.39]\n[00:44.18]夜空中最亮的星 能否记起\n[00:51.76]\n[00:54.48]曾与我同行 消失在风里的身影\n[01:02.85]\n[01:03.76]我祈祷拥有一颗透明的心灵\n[01:09.25]\n[01:09.93]和会流泪的眼睛\n[01:14.85]\n[01:16.51]给我再去相信的勇气\n[01:19.77]\n[01:20.39]越过谎言去拥抱你\n[01:25.37]每当我找不到存在的意义\n[01:30.45]每当我迷失在黑夜里\n[01:35.15]\n[01:37.29]夜空中最亮的星\n[01:40.36]\n[01:41.01]请指引我靠近你\n[01:46.83]\n[01:53.21]夜空中最亮的星 是否知道\n[02:00.72]\n[02:03.50]曾与我同行的身影 如今在哪里\n[02:12.01]\n[02:14.73]夜空中最亮的星 是否在意\n[02:22.38]\n[02:24.79]是等太阳升起 还是意外先来临\n[02:32.91]\n[02:34.44]我宁愿所有痛苦都留在心里\n[02:40.22]也不愿忘记你的眼睛\n[02:45.08]\n[02:46.89]给我再去相信的勇气\n[02:50.44]哦越过谎言去拥抱你\n[02:55.40]每当我找不到存在的意义\n[03:00.64]每当我迷失在黑夜里\n[03:05.59]哦\n[03:06.23]\n[03:07.32]夜空中最亮的星\n[03:10.52]\n[03:11.03]哦 请照亮我前行\n[03:18.54]\n[03:35.55]我祈祷拥有一颗透明的心灵\n[03:40.94]\n[03:41.51]和会流泪的眼睛\n[03:46.28]\n[03:47.86]给我再去相信的勇气\n[03:51.01]\n[03:51.68]越过谎言去拥抱你\n[03:56.30]每当我找不到存在的意义\n[04:01.23]每当我迷失在黑夜里\n[04:05.86]\n[04:07.70]夜空中最亮的星\n[04:11.38]请照亮我的前行\n[04:16.97]\n[04:25.64]夜空中最亮的星 能否听清\n[04:33.26]\n[04:35.77]那仰望的人 心底的孤独和叹息","url":"http://dl.stream.qqmusic.qq.com/C100001RNAxF3N9zmR.m4a?fromtag=38","pic":"http://y.gtimg.cn/music/photo_new/T002R300x300M000003zHRu42g0Jjw.jpg"},{"type":"qq","link":"http://y.qq.com/n/yqq/song/000ZtyIi0q5qzk.html","songid":"000ZtyIi0q5qzk","title":"夜空中最亮的星（纯音乐-电子迷幻钢琴哼唱版）","author":"小果酱","lrc":"[00:00:00]此歌曲为没有填词的纯音乐，请您欣赏","url":"http://dl.stream.qqmusic.qq.com/C100000ZtyIi0q5qzk.m4a?fromtag=38","pic":"http://y.gtimg.cn/music/photo_new/T002R300x300M000001ZaCQY2OxVMg.jpg"},{"type":"qq","link":"http://y.qq.com/n/yqq/song/001F9qx40Gwm8Y.html","songid":"001F9qx40Gwm8Y","title":"夜空中最亮的星","author":"周玥","lrc":"[ti:夜空中最亮的星]\n[ar:周玥]\n[al:好不容易]\n[by:]\n[offset:0]\n[00:00.00]夜空中最亮的星 - 周玥\n[00:03.75]词：逃跑计划\n[00:07.50]曲：逃跑计划\n[00:11.26]夜空中最亮的星\n[00:15.95]能否听清\n[00:20.97]那仰望的人 心底的孤独和叹息\n[00:30.72]夜空中最亮的星\n[00:35.47]能否记起\n[00:40.31]曾与我同行 消失在风里的身影\n[00:49.08]我祈祷拥有一颗透明的心灵\n[00:54.66]和会流泪的眼睛\n[01:00.78]给我再去相信的勇气\n[01:04.36]Oh越过谎言去拥抱你\n[01:08.80]每当我找不到存在的意义\n[01:14.18]每当我迷失在黑夜里\n[01:20.49]夜空中最亮的星\n[01:24.01]请指引我靠近你\n[01:32.21]夜空中最亮的星\n[01:36.72]是否知道\n[01:41.45]那曾与我同行的身影如今在哪里\n[01:51.63]夜空中最亮的星\n[01:56.18]是否在意\n[02:00.87]是等太阳升起\n[02:03.35]还是意外先来临\n[02:09.79]我宁愿所有痛苦都留在心里\n[02:15.28]也不愿忘记你的眼睛\n[02:21.48]给我再去相信的勇气\n[02:25.11]Oh越过谎言去拥抱你\n[02:29.53]每当我找不到存在的意义\n[02:34.94]每当我迷失在黑夜里\n[02:41.25]夜空中最亮的星\n[02:44.87]Oh请照亮我前行\n[02:49.05]我祈祷拥有一颗透明的心灵\n[02:54.59]和会流泪的眼睛\n[03:00.77]给我再去相信的勇气\n[03:04.34]Oh越过谎言去拥抱你\n[03:08.59]每当我找不到存在的意义\n[03:14.11]每当我迷失在黑夜里\n[03:20.27]夜空中最亮的星\n[03:24.09]Oh请照亮我前行","url":"http://dl.stream.qqmusic.qq.com/C100001F9qx40Gwm8Y.m4a?fromtag=38","pic":"http://y.gtimg.cn/music/photo_new/T002R300x300M000002sZSFV2iH7R6.jpg"},{"type":"qq","link":"http://y.qq.com/n/yqq/song/004TtAFI2xlwQv.html","songid":"004TtAFI2xlwQv","title":"夜空中最亮的星 (原唱: 逃跑计划)","author":"东南大学师生","lrc":"[ti:夜空中最亮的星 (原唱: 逃跑计划)]\n[ar:东南大学师生]\n[al:东南大学 2020 \u201c青春战\u2018疫\u2019为爱而歌\u201d战\u201c疫\u201d云合唱 ]\n[by:]\n[offset:0]\n[00:00.00]夜空中最亮的星 (原唱: 逃跑计划) - 东南大学师生\n[00:01.66]词：逃跑计划\n[00:03.33]曲：逃跑计划\n[00:05.00]发行：合听音乐\n[00:06.67]演唱音频均由东南大学师生于疫情期间线上志愿完成\n[00:11.22]音乐发起人：共青团东南大学委员会\n[00:14.87]监制：杨江凌\n[00:15.92]制作：何泓贤\n[00:18.21]夜空中最亮的星\n[00:22.49]能否听清\n[00:26.97]那仰望的人\n[00:29.17]心底的孤独和叹息\n[00:35.79]Oh夜空中最亮的星\n[00:40.27]能否记起\n[00:44.66]曾与我同行\n[00:46.90]消失在风里的身影\n[00:52.26]我祈祷拥有一颗透明的心灵\n[00:57.44]和会流泪的眼睛\n[01:02.97]给我再去相信的勇气\n[01:06.30]Oh越过谎言去拥抱你\n[01:10.34]每当我找不到存在的意义\n[01:15.24]每当我迷失在黑夜里\n[01:19.84]Oh夜空中最亮的星\n[01:24.12]请指引我靠近你\n[01:38.30]夜空中最亮的星\n[01:42.42]是否知道\n[01:46.93]曾与我同行的身影\n[01:49.89]如今在哪里\n[01:55.80]Oh夜空中最亮的星\n[02:00.24]是否在意\n[02:04.43]是等太阳升起\n[02:06.87]还是意外先来临\n[02:12.50]我宁愿所有痛苦都留在心里\n[02:17.47]也不愿忘记你的眼睛\n[02:23.22]给我再去相信的勇气\n[02:26.38]Oh越过谎言去拥抱你\n[02:30.50]每当我找不到存在的意义\n[02:35.30]每当我迷失在黑夜里\n[02:39.82]Oh夜空中最亮的星\n[02:44.27]Oh请照亮我前行\n[03:05.78]我祈祷拥有一颗透明的心灵\n[03:10.86]和会流泪的眼睛\n[03:16.54]给我再去相信的勇气\n[03:19.65]Oh越过谎言去拥抱你\n[03:23.73]每当我找不到存在的意义\n[03:28.59]每当我迷失在黑夜里\n[03:33.16]Oh夜空中最亮的星\n[03:37.49]Oh请照亮我前行\n[03:51.60]夜空中最亮的星\n[03:55.67]能否听清\n[04:00.23]那仰望的人\n[04:02.45]心底的孤独和叹息","url":"http://dl.stream.qqmusic.qq.com/C100004TtAFI2xlwQv.m4a?fromtag=38","pic":"http://y.gtimg.cn/music/photo_new/T002R300x300M000003mkIRH0m0zph.jpg"},{"type":"qq","link":"http://y.qq.com/n/yqq/song/003IUry21hFDfn.html","songid":"003IUry21hFDfn","title":"夜空中最亮的星 (原唱:逃跑计划)","author":"戴羽彤","lrc":"[ti:夜空中最亮的星 (Cover：逃跑计划)]\n[ar:戴羽彤]\n[al:戴羽彤的翻唱集]\n[by:]\n[offset:0]\n[00:00.00]夜空中最亮的星 (原唱:逃跑计划) - 戴羽彤\n[00:06.46]词：逃跑计划\n[00:12.93]曲：逃跑计划\n[00:19.40]夜空中最亮的星 能否听清\n[00:27.87]那仰望的人\n[00:30.02]心底的孤独和叹息\n[00:36.93]夜空中最亮的星 能否记起\n[00:45.40]那曾与我同行\n[00:48.05]消失在风里的身影\n[00:53.73]我祈祷拥有一颗透明的心灵\n[00:58.96]和会流泪的眼睛\n[01:04.54]给我再去相信的勇气\n[01:07.91]越过谎言去拥抱你\n[01:11.94]每当我找不到存在的意义\n[01:16.63]每当我迷失在黑夜里\n[01:20.94]噢喔喔 夜空中最亮的星\n[01:25.82]请指引我靠近你\n[01:40.16]夜空中最亮的星 是否知道\n[01:48.43]那曾与我同行的身影\n[01:51.61]如今在哪里\n[01:57.84]夜空中最亮的星 是否在意\n[02:06.38]是等太阳升起\n[02:08.79]还是意外先来临\n[02:14.44]我宁愿所有痛苦都留在心底\n[02:19.46]也不愿忘记你的眼睛\n[02:24.69]哦 给我再去相信的勇气\n[02:28.39]哦 越过谎言去拥抱你\n[02:32.66]每当我找不到存在的意义\n[02:37.49]每当我迷失在黑夜里\n[02:41.84]噢喔喔 夜空中最亮的星\n[02:46.61]请照亮我向前行 哒\n[03:08.59]我祈祷拥有一颗透明的心灵\n[03:13.45]和会流泪的眼睛 哦\n[03:19.14]给我再去相信的勇气\n[03:22.31]哦 越过谎言去拥抱你\n[03:26.54]每当我找不到存在的意义\n[03:31.12]每当我迷失在黑夜里\n[03:35.83]噢喔喔 夜空中最亮的星\n[03:40.31]请照亮我向前行","url":"http://dl.stream.qqmusic.qq.com/C100003IUry21hFDfn.m4a?fromtag=38","pic":"http://y.gtimg.cn/music/photo_new/T002R300x300M000000dml0y2Vj5qU.jpg"}]
     * code : 200
     * error :
     */

    private int code;
    private String error;
    private List<DataBean> data;

    public int getCode() {
        return code;
    }

    public void setCode(int code) {
        this.code = code;
    }

    public String getError() {
        return error;
    }

    public void setError(String error) {
        this.error = error;
    }

    public List<DataBean> getData() {
        return data;
    }

    public void setData(List<DataBean> data) {
        this.data = data;
    }

    public static class DataBean {
        /**
         * type : qq
         * link : http://y.qq.com/n/yqq/song/001NmPTG1fVsUw.html
         * songid : 001NmPTG1fVsUw
         * title : 夜空中最亮的星
         * author : 逃跑计划
         * lrc : [ti:夜空中最亮的星 (《摘星的你》微电影主题曲)]
         [ar:逃跑计划]
         [al:世界]
         [by:]
         [offset:0]
         [00:00.00]夜空中最亮的星 - 逃跑计划 (Escape Plan)
         [00:06.08]词：逃跑计划
         [00:12.17]曲：逃跑计划
         [00:18.25]夜空中最亮的星 能否听清
         [00:24.66]
         [00:27.01]那仰望的人 心底的孤独和叹息
         [00:33.60]
         [00:35.89]Oh 夜空中最亮的星 能否记起
         [00:42.58]
         [00:44.80]曾与我同行 消失在风里的身影
         [00:50.61]
         [00:52.52]我祈祷拥有一颗透明的心灵
         [00:57.66]和会流泪的眼睛
         [01:01.01]
         [01:03.21]给我再去相信的勇气
         [01:06.51]Oh 越过谎言去拥抱你
         [01:10.49]每当我找不到存在的意义
         [01:15.31]每当我迷失在黑夜里
         [01:18.93]
         [01:19.60]Oh 夜空中最亮的星
         [01:24.26]请指引我靠近你
         [01:28.20]
         [01:38.30]夜空中最亮的星 是否知道
         [01:44.88]
         [01:46.94]曾与我同行的身影 如今在哪里
         [01:52.84]
         [01:55.93]Oh 夜空中最亮的星 是否在意
         [02:02.39]
         [02:04.38]是等太阳升起 还是意外先来临
         [02:10.64]
         [02:12.45]我宁愿所有痛苦都留在心里
         [02:17.55]也不愿忘记你的眼睛
         [02:21.35]
         [02:23.18]给我再去相信的勇气
         [02:26.40]Oh 越过谎言去拥抱你
         [02:30.64]每当我找不到存在的意义
         [02:35.27]每当我迷失在黑夜里
         [02:39.79]Oh 夜空中最亮的星
         [02:44.15]Oh 请照亮我前行
         [02:48.20]
         [03:06.13]我祈祷拥有一颗透明的心灵
         [03:11.02]和会流泪的眼睛
         [03:14.63]
         [03:16.51]给我再去相信的勇气
         [03:19.68]Oh 越过谎言去拥抱你
         [03:22.74]
         [03:23.83]每当我找不到存在的意义
         [03:28.70]每当我迷失在黑夜里
         [03:32.16]
         [03:33.09]Oh 夜空中最亮的星
         [03:37.49]Oh 请照亮我前行
         [03:43.10]
         [03:51.37]夜空中最亮的星 能否听清
         [03:58.03]
         [04:00.22]那仰望的人 心底的孤独和叹息
         * url : http://dl.stream.qqmusic.qq.com/C100001NmPTG1fVsUw.m4a?fromtag=38
         * pic : http://y.gtimg.cn/music/photo_new/T002R300x300M000000wr4zc1gls3e.jpg
         */

        private String type;
        private String link;
        private String songid;
        private String title;
        private String author;
        private String lrc;
        private String url;
        private String pic;

        public String getType() {
            return type;
        }

        public void setType(String type) {
            this.type = type;
        }

        public String getLink() {
            return link;
        }

        public void setLink(String link) {
            this.link = link;
        }

        public String getSongid() {
            return songid;
        }

        public void setSongid(String songid) {
            this.songid = songid;
        }

        public String getTitle() {
            return title;
        }

        public void setTitle(String title) {
            this.title = title;
        }

        public String getAuthor() {
            return author;
        }

        public void setAuthor(String author) {
            this.author = author;
        }

        public String getLrc() {
            return lrc;
        }

        public void setLrc(String lrc) {
            this.lrc = lrc;
        }

        public String getUrl() {
            return url;
        }

        public void setUrl(String url) {
            this.url = url;
        }

        public String getPic() {
            return pic;
        }

        public void setPic(String pic) {
            this.pic = pic;
        }
    }
}
